[
  {
    "location_code": "1A",
    "location_name": "Gedung Sipil A",
    "latitude": -6.892221066610313,
    "longitude": 107.60965117981611,
    "description": "Gedung ini dibangun pada masa kolonial 1923-1924,terdiri dari 2 ruang kuliah besar untuk ruang kuliah tingkat satu dan tingkat empat (sekarang dinamakan \"Ruang 3201\" dan \"Ruang 3202\", didesain oleh dibuat Ir. Henri MacLaine Pont dengan bentuk atap bentuk atap 'julang ngapak', pilar-pilar batu alam, dan elemen-elemen detail bangunan lainnya secara konsisten.",
    "src": "/maps/1A.jpg"
  },
  {
    "location_code": "1B",
    "location_name": "Gedung Sipil B",
    "latitude": -6.892222397882885,
    "longitude": 107.60965050984039,
    "description": "Gedung ini dibangun pada masa kolonial 1923-1924, terdiri dari ruang gambar arsitektur/ilmu bangunan berukuran panjang 50 meter, ruang maket/modellenzaal, dan ruang asisten. didesain oleh dibuat Ir. Henri MacLaine Pont dengan bentuk atap bentuk atap 'julang ngapak', pilar-pilar batu alam, dan elemen-elemen detail bangunan lainnya secara konsisten.",
    "src": "/maps/1B.jpg"
  },
  {
    "location_code": "1C",
    "location_name": "Benteng Sipil",
    "latitude": -6.89228164682432,
    "longitude": 107.60852299761194,
    "description": null,
    "src": "/maps/1C.jpg"
  },
  {
    "location_code": "1D",
    "location_name": "BSC A",
    "latitude": -6.891824095136945,
    "longitude": 107.60858889765587,
    "description": "Gedung yang mengakomodasikan Laboratorium Fisika Dasar, berlantai lima dengan satu lantai basement yang berlokasi pada posisi 6°53'30\" LS, 107°36'30\" BT. dibangun dan mulai digunakan sekitar April 2003, Di atas lokasi gedung ini sebelumnya pernah berdiri Gedung Biro Pembelian dan Gedung \"panggung\" BRT",
    "src": "/maps/1D.jpg"
  },
  {
    "location_code": "1E",
    "location_name": "Gedung CIBE",
    "latitude": -6.891407559927436,
    "longitude": 107.608657404616,
    "description": "Berlokasi pada posisi 6°53'29\" LS, 107°36'31\" BT,  memiliki luas lantai dasar 2.505 meter persegi, luas total 7.985 meter persegi, dengan ketinggian 8 lantai dan satu lantai basement, i atas lokasi gedung sebelumnya pernah berdiri gedung",
    "src": "/maps/1E.jpg"
  },
  {
    "location_code": "1F",
    "location_name": "Aula Barat",
    "latitude": -6.892522397882885,
    "longitude": 107.60978050984039,
    "description": "Barakgebouw A sekarang Aula Barat adalah gedung pertama yang dibangun di Kampus TH Bandung, namun baru dapat diselesaikan sekitar bulan Juni 1921, dan langsung digunakan untuk pelaksanaan acara Dies Natalis ke-1 TH Bandung pada hari Sabtu, 2 Juli 1921. Mulai digunakan sebagai aula sejak tahun 1989, sedangkan sebelumnya digunakan sebagai kantor administrasi, perpustakaan, ruang kuliah, laboratorium, dan sebagainya.",
    "src": "/maps/1F.jpg"
  },
  {
    "location_code": "1G",
    "location_name": "Tembok Ratapan",
    "latitude": -6.891313494541475,
    "longitude": 107.60960075163808,
    "description": null,
    "src": "/maps/1G.jpg"
  },
  {
    "location_code": "1H",
    "location_name": "CC Barat",
    "latitude": -6.891284760490206,
    "longitude": 107.61004538403428,
    "description": "Berlokasi pada posisi 6°53'28.50\" LS, 107°36'36\" BT, sebagian difungsikan untuk menampung kegiatan mahasiswa khususnya bagi unit-unit yang sedang melakukan kegiatan yang memerlukan sekretariat. Terdapat satu ruangan yang nyaman dan luas yang difungsikan sebagai student lounge. Lantai teratas gedung ini berfungsi sebagai kantin dengan kapasitas sekitar 150 orang. Terdapat pula bangunan yang membujur utara-selatan dengan 4 (empat) ruang latihan yang dilengkapi ruang simpan alat bagi unit-unit kesenian mahasiswa.",
    "src": "/maps/1H.jpg"
  },
  {
    "location_code": "1I",
    "location_name": "Lapangan Voli dan Basket",
    "latitude": -6.891626730464683,
    "longitude": 107.61026108856214,
    "description": "Awalnya, ITB memiliki 4 lapangan tenis yang berada di halaman tengah kampus yaitu 2 buah di sisi barat dan 2 buah di sisi timur jalan utama kampus. Lapangan tenis ini dibangun sekitar tahun 1923. Sekitar sebelum tahun 1950an lapangan tenis di sisi barat diubah menjadi lapangan basket dan dua buah lapangan voli.\n",
    "src": "/maps/1I.jpg"
  },
  {
    "location_code": "2A",
    "location_name": "Galeri Sumardja",
    "latitude": -6.892490483646159,
    "longitude": 107.6115383141133,
    "description": "Galeri Sumardja merupakan salah satu galeri seni terkemuka di Indonesia. Galeri Sumardja banyak menampilkan pameran seni, desain, dan kebudayaan baik dalam skala nasional maupun internasinal. Galeri Sumardja memiliki luas 370 M 2 . Selain digunakan untuk pameran, Galeri Sumardja juga dapat difungsikan sebagai tempat kegiatan Workshop, pameran karya-karya mahasiswa, studio kuliah umum, seminar, sidang tugas akhir, dan lain-lain.\n",
    "src": "/maps/2A.png"
  },
  {
    "location_code": "2B",
    "location_name": "Aula Timur",
    "latitude": -6.892515575999724,
    "longitude": 107.61103743816561,
    "description": "Barakgebouw B sekarang Aula Timur termasuk gedung pertama yang dibangun di Kampus ITB. Gedung ini mulai dibangun pada tahun 1919, lalu diresmikan pada 3 Juli 1920, tetapi baru pada saat bulan Desember 1920 bangunan tersebut mendekati selesai. Arsitek dari bangunan ini adalah Ir. Henri MacLaine Pont",
    "src": "/maps/2B.png"
  },
  {
    "location_code": "2C",
    "location_name": "Gedung kuliah LFM",
    "latitude": -6.891941123252277,
    "longitude": 107.61095952598752,
    "description": "Gedung kuliah LFM ini dibangun sekitar tahun 1939 untuk mengantisipasi meningkatnya jumlah mahasiswa baru ITB. Gedung berbentuk amphitheater dengan kapasitas 140 orang untuk perkuliahan ilmu bahan bangunan ini mulai digunakan pada bulan Agustus 1940. Sejak tahun 1950an selain digunakan untuk perkuliahan juga dipakai sebagai bioskop mahasiswa - Liga Film Mahasiswa ITB",
    "src": "/maps/2C.png"
  },
  {
    "location_code": "2D",
    "location_name": "Lapangan Cinta",
    "latitude": -6.891543029713376,
    "longitude": 107.61078045598185,
    "description": "Lapangan Cinta merupakan singkatan dari  lapangan cinta. Lapangan ini berlokasi di sebelah selatan gedung Campus Center Timur. Dinamakan  lapangan cinta karena tempat ini menjadi saksi mahasiswa ITB untuk menyatakan cinta. Tempat ini dilengkapi bangku-bangku serta pohon yang rindang sehingga jadi spot favorit mahasiswa untuk melepas penat.",
    "src": "/maps/2D.png"
  },
  {
    "location_code": "2E",
    "location_name": "Gedung Labtek IXA Sugijanto Soegijoko",
    "latitude": -6.891566549963845,
    "longitude": 107.61124459472377,
    "description": "Gedung Laboratorium Teknik IX A disingkat Labtek IX A merupakan gedung yang mengakomodasikan kantor administrasi Sekolah Arsitektur, Perencanaan dan Pengembangan Kebijakan (SAPPK), serta Program Studi Teknik Planologi/Perencanaan Wilayah dan Kota. Gedung berlantai enam ini berlokasi pada posisi 6°53'29.5\" LS, 107°36'41\" BT atau di sebelah tenggara kampus. Peresmian Gedung SAPPK-ITB menjadi Gedung Labtek IX-A Sugijanto Soegijoko , dilaksanakan pada hari Sabtu, 16 September 2017.",
    "src": null
  },
  {
    "location_code": "2G",
    "location_name": "Gedung Arsitektur (Labtek IXB)",
    "latitude": -6.891897903894327,
    "longitude": 107.61188259684025,
    "description": "Gedung berlantai tiga ini semula digunakan untuk Bagian Arsitektur, yang namanya pernah berubah menjadi Departemen Perencanaan dan Seni Rupa (DPSR), kemudian Departemen Arsitektur, lalu Jurusan Teknik Arsitektur, hingga Program Pendidikan Arsitektur. Gedung Arsitektur dan gedung Geodesi mulai dibangun pada akhir tahun 1951 dan selesai pertengahan tahun 1953. Sekitar tahun 1994 gedung ini dibongkar total dan di atasnya dibangun kembali menjadi Labtek IX B untuk Program Pendidikan Arsitektur.",
    "src": "/maps/2G.png"
  },
  {
    "location_code": "2I",
    "location_name": "CC Timur",
    "latitude": -6.8912584439982155,
    "longitude": 107.6107282451819,
    "description": "Seluas ± 2000 m² yang berlokasi pada posisi 6°53'28.50\" LS, 107°36'39\" BT, difungsikan sebagai Ruang Pameran Temporer yang dilengkapi oleh auditorium berkapasitas 150 orang untuk menerima tamu dalam jumlah besar, sedangkan lantai teratas sayap timur direncanakan sebagai faculty-lounge.",
    "src": "/maps/2I.png"
  },
  {
    "location_code": "3C",
    "location_name": "Amphiteathre GKUB",
    "latitude": -6.890522723901467,
    "longitude": 107.60917611428353,
    "description": "Ruang terbuka berbentuk amphitheater yang sering digunakan bersama dalam acara-acara baik oleh mahasiswa maupun acara yang diadakan oleh departemen, dengan Kolom silinder dari batu kali dan bentuk atap yang khas menjadi unsure utama yang kembali diulang dalam gubahan massanya.",
    "src": "/maps/3C.jpg"
  },
  {
    "location_code": "3E",
    "location_name": "Gedung GKUB",
    "latitude": -6.890413830403982,
    "longitude": 107.6086917614954,
    "description": "Gedung Kuliah Umum yang satu ini diprakarsai pembangunannya oleh Presiden RI pertama, Ir. Soekarno, sebelum menjabat sebagai presiden. Saat ini GKU Barat terdiri dari 4 lantai, beberapa toilet, dan di selasarnya terdapat kantin makanan dan musholla.",
    "src": "/maps/3E.jpg"
  },
  {
    "location_code": "3F",
    "location_name": "Taman Botani",
    "latitude": -6.8902881106108085,
    "longitude": 107.60850881706801,
    "description": "Salah satu taman yang berada di ITB dan terkenal dengan suasana yang cukup asri untuk sekedar istirahat, merupakan taman milih dari fakultas SITH",
    "src": "/maps/3F.jpg"
  },
  {
    "location_code": "3G",
    "location_name": "Teras FTMD",
    "latitude": -6.890103108618682,
    "longitude": 107.60878399679095,
    "description": "Teras FTMD mulai dirancang awal 2021 dengan 10 kali literasi desain arsitektur dan memakan waktu 6 bulan untuk finalisasi termasuk observasi yang dilakukan oleh tim. Teras FTMD akan menjadi laboratorium peraga secara langsung bagi mahasiswa dan pengunjung di FTMD sehingga pengunjung dapat melihat mekanisme gerak dan energi terbarukan. Teras FTMD akan menjadi tempat ikonik dan kenangan serta menjadi kebanggaan bagi FTMD dan ITB.",
    "src": "/maps/3G.jpg"
  },
  {
    "location_code": "3H",
    "location_name": "Gedung Perkuliahan FTMD",
    "latitude": -6.889786734176823,
    "longitude": 107.60888286172627,
    "description": "Tempat kuliah salah satu Presiden Indonesia, bersebelahan dengan 3j, utara gedung ir. Soekarno",
    "src": "/maps/3H.jpg"
  },
  {
    "location_code": "3I",
    "location_name": "Labtek VI TP Rachmat",
    "latitude": -6.890238223834338,
    "longitude": 107.60960704743633,
    "description": "Gedung Laboratorium Teknik VI disingkat Labtek VI atau Gedung T. P. Rachmat ini mulai dibangun pada tahun 1993 dan diresmikan pada 11 Maret 1995. Gedung ini merupakan gedung yang mengakomodasikan Program Studi Teknik Fisika (lantai 2), Program Studi Teknik Kelautan (lantai 3), dan unit pendukung kegiatan akademik. Gedung ini berlokasi pada posisi 6°53'24.5\" LS, 107°36'35\" BT.",
    "src": "/maps/3I.jpg"
  },
  {
    "location_code": "3J",
    "location_name": "Labtek V Benny Subianto",
    "latitude": -6.890680467989063,
    "longitude": 107.61007247973404,
    "description": "Gedung Laboratorium Teknik V disingkat Labtek V atau Gedung Benny Subianto ini mulai dibangun pada tahun 1993 dan diresmikan pada 11 Maret 1995. Gedung ini merupakan gedung yang mengakomodasikan Program Studi Teknik Elektro, Program Studi Teknik Tenaga Listrik, Program Studi Teknik Telekomunikasi, Program Studi Sistem dan Teknologi Informasi, Program Studi Informatika, kantor administrasi Fakultas Teknologi Industri, dan unit pendukung kegiatan akademik. Gedung Labtek V berlokasi pada posisi 6°53'26\" LS, 107°36'35\" BT atau di sebelah selatan Labtek VI.",
    "src": "/maps/3J.jpg"
  },
  {
    "location_code": "4A",
    "location_name": "Tugu Soekarno",
    "latitude": -6.890882967660562,
    "longitude": 107.61036113865602,
    "description": "Di sekitar Plaza Widya, terdapat sebuah monumen dengan tulisan \"Sekali Teman Tetap Teman\". Karena itu, monumen ini juga disebut Friendship Monument. Konon katanya, jika sepasang kekasih menyatakan cintanya di monumen ini, cinta mereka tidak akan tumbuh dan keduanya akan selalu menjadi teman selamanya. Tugu Soekarno merupakan tugu peresmian ITB oleh Soekarno tahun 1959. Katanya, tugu ini dapat dipakai sebagai jam matahari.",
    "src": "/maps/4A.png"
  },
  {
    "location_code": "4B",
    "location_name": "Labtek VIII",
    "latitude": -6.890613833701469,
    "longitude": 107.61054490932494,
    "description": "Gedung Laboratorium Teknik VIII disingkat Labtek VIII atau Gedung Achmad Bakrie ini merupakan gedung yang mengakomodasikan kantor administrasi Sekolah Teknik Elektro dan Informatika (STEI), kantor administrasi Fakultas Matematika dan Ilmu Pengetahuan Alam (FMIPA), dan unit pendukung kegiatan akademik di antaranya UPT Bahasa. Gedung Labtek VIII yang berlokasi pada posisi 6°53'26\" LS, 107°36'39\" BT atau di sebelah selatan Labtek VII ini menempati bekas gedung Teknik Informatika (bekas Centraal Electrisch Laboratorium, Laboratorium Teknik Kimia, dan lapangan sepak bola yang telah dibongkar sebelumnya. Pada acara Dies Emas ITB tanggal 3 Maret 2009 nama gedung ini diresmikan menjadi \"Gedung Achmad Bakrie\" (nama orang tua Aburizal Bakrie - alumnus Teknik Elektro ITB).",
    "src": "/maps/4B.png"
  },
  {
    "location_code": "4C",
    "location_name": "Lab Doping",
    "latitude": -6.890842025938123,
    "longitude": 107.61160476819957,
    "description": "Gedung Laboratorium Pengujian Doping merupakan fasilitas uji doping pertama di Indonesia dan menambah fasilitas uji doping dunia yang sebelumnya hanya berjumlah sekitar 34 buah. Gedung yang berlokasi pada posisi 6°53'27\" LS, 107°36'43\" BT atau di sebelah selatan GKU Timur ITB memiliki luas 3.876 meter persegi berlantai lima dan satu lantai basement parkir ini menempati lahan yang dulunya merupakan tempat parkir dosen/karyawan ITB yang telah dibongkar sebelumnya (sebelumnya lagi merupakan lokasi Gedung Kembar. Gedung ini mulai dibangun sejak Agustus 2012 dan diresmikan penggunaannya oleh Rektor ITB Prof. Akhmaloka pada hari Rabu, 20 Februari 2013.",
    "src": "/maps/4C.png"
  },
  {
    "location_code": "4E",
    "location_name": "Labtek XVII",
    "latitude": -6.890805944003029,
    "longitude": 107.61216451915599,
    "description": "Gedung Laboratorium Teknik XVII “Dato' Dr. Low Tuck Kwong” memiliki luas kurang lebih 14oo meter persegi. Arsitek bangunan tersebut adalah Ir. Basauli Umar Lubis MSA, Ph.D yang juga staf pengajar di Sekolah Arsitektur, Perencanaan dan Pengembangan Kebijakan di ITB. Bangunan akan diperuntukkan sebagai kantor logistik, data spasial, konseling, sarana dan prasarana, kelas dan laboratorium teknik lingkungan, kantor pusat Carbon Capture Storage and Carbon Capture Utility and Storage.",
    "src": "/maps/4E.png"
  },
  {
    "location_code": "4F",
    "location_name": "GKUT",
    "latitude": -6.890359768560657,
    "longitude": 107.61192030808624,
    "description": "Gedung Kuliah Umum (GKU) Timur yang berlantai empat ini berlokasi pada posisi 6°53'25\" LS, 107°36'43\" BT atau di sebelah selatan Laboratorium Gelombang Teknik Kelautan, yang menempati bekas Gedung Pusat Teknologi Pembangunan (Development Technology Center - DTC) dan Lembaga Penelitian yang telah dibongkar sebelumnya. Gedung ini selesai dibangun pada 1989.",
    "src": "/maps/4F.png"
  },
  {
    "location_code": "4I",
    "location_name": "Labtek VII Sekolah Farmasi",
    "latitude": -6.8901167367941225,
    "longitude": 107.61053768356965,
    "description": "Gedung Laboratorium Teknik VII disingkat Labtek VII atau Gedung Yusuf Panigoro ini mulai dibangun pada 1995 dan diresmikan pada 28 Desember 1996. Gedung ini merupakan gedung yang mengakomodasikan jurusan Farmasi (sejak 1 Januari 2006 dimekarkan menjadi Sekolah Farmasi - SF), Sosioteknologi (dulu MKDU), dan unit pendukung kegiatan akademik. Gedung Labtek VII yang berlokasi pada posisi 6°53'24.5\" LS, 107°36'39\" BT atau di antara Labtek VIII dan Laboratorium PLN.",
    "src": null
  },
  {
    "location_code": "4J",
    "location_name": "Laboratorium Hidraulik",
    "latitude": -6.89010382323384,
    "longitude": 107.6120044682154,
    "description": "Taman Timur Lab Hidraulik: Laboratorium Teknik Kelautan berdiri sejak tahun 1994 dan bertempat di Gedung Laboratorium Rekayasa Sumber Daya Air (Lab. Uji Model Hidraulika). Laboratorium Teknik Kelautan, Fakultas Teknik Sipil dan Lingkungan merupakan laboratorium yang melakukan kegiatan praktikum dan penelitian yang melibatkan gelombang air.",
    "src": null
  },
  {
    "location_code": "5A",
    "location_name": "Taman Alat Mete",
    "latitude": -6.889612397563759,
    "longitude": 107.60966460931513,
    "description": null,
    "src": "/maps/5A.jpg"
  },
  {
    "location_code": "5B",
    "location_name": "Labtek IX",
    "latitude": -6.88961040043298,
    "longitude": 107.6096632682107,
    "description": "Gedung Laboratorium Teknik X atau disingkat Labtek X ini merupakan gedung yang mengakomodasikan Program Studi Teknik Kimia dan Program Studi Teknik Material. Gedung Labtek X yang berlokasi pada posisi 6°53'20.5\" LS, 107°36'34\" BT. Di antara Labtek X dan Labtek XI terdapat fasilitas bersama sekitar 1.200 meter persegi. Karena warnanya yang didominasi oleh warna biru, warga kampus sering menyebut kedua Labtek ini dengan \"Labtek Biru\".",
    "src": "/maps/5B.jpg"
  },
  {
    "location_code": "5D",
    "location_name": "Labtek X",
    "latitude": -6.888944401111291,
    "longitude": 107.6096997976519,
    "description": "Gedung Laboratorium Teknik X atau disingkat Labtek X ini merupakan gedung yang mengakomodasikan Program Studi Teknik Kimia dan Program Studi Teknik Material. Labtek X dan XI yang memilih bentuk yang sama sekali berbeda dengan bangunan legendaris Aula Barat dan Timur. Gedung Labtek X yang berlokasi pada posisi 6°53'20.5\" LS, 107°36'34\" BT atau di bagian barat laut-utara kampus ini menempati bekas Gedung MKDU, Gedung Puskom dan PIKSI, dan bengkel Teknik Mesin yang telah dibongkar sebelumnya. Di antara Labtek X dan Labtek XI terdapat fasilitas bersama sekitar 1.200 meter persegi. Karena warnanya yang didominasi oleh warna biru, warga kampus sering menyebut kedua Labtek ini dengan \"Labtek Biru\".",
    "src": "/maps/5D.jpg"
  },
  {
    "location_code": "5E",
    "location_name": "Lab Pilot",
    "latitude": -6.888785081004716,
    "longitude": 107.60977903691736,
    "description": "6°53'19.7\"S 107°36'34.4\"E, berada di selatan gedung CADL.",
    "src": "/maps/5E.jpg"
  },
  {
    "location_code": "5F",
    "location_name": "Taman Gedung TI",
    "latitude": -6.8886871369587075,
    "longitude": 107.60897115225093,
    "description": null,
    "src": "/maps/5F.jpg"
  },
  {
    "location_code": "5G",
    "location_name": "Gedung PPTI-FTMD sisi timur",
    "latitude": -6.889027315440301,
    "longitude": 107.60898992771311,
    "description": "Mulai dibangun pada tahun 2014, dengan sumber dana dari APBN Kemenperin, dan selesai dibangun pada tahun 2015. Gedung ini adalah hasil kerjasama antara Fakultas Teknik Mesin dan Dirgantara (FTMD) dan Direktorat Jenderal Industri Unggulan Berbasis Teknologi Tinggi Kementerian Perindustrian Republik Indonesia (Ditjen IUBTT Kemenperin). Gedung yang berlokasi pada posisi 6°53'20.5\" LS, 107°36'31.6\" BT. Gedung berlantai empat dengan satu lantai mezanin ini memiliki luas lantai dasar 1.300 meter persegi, luas total 6.900 meter persegi.",
    "src": "/maps/5G.jpg"
  },
  {
    "location_code": "5H",
    "location_name": "Lorong antar FTMD",
    "latitude": -6.889066498122013,
    "longitude": 107.60870813875754,
    "description": "Jalan pintas menuju gerbang batan jika dari Jalan E",
    "src": "/maps/5H.jpg"
  },
  {
    "location_code": "5I",
    "location_name": "Gedung PPTI-FTMD sisi barat",
    "latitude": -6.889024490025655,
    "longitude": 107.60836462527715,
    "description": "Mulai dibangun pada tahun 2014, dengan sumber dana dari APBN Kemenperin, dan selesai dibangun pada tahun 2015. Gedung ini adalah hasil kerjasama antara Fakultas Teknik Mesin dan Dirgantara (FTMD) dan Direktorat Jenderal Industri Unggulan Berbasis Teknologi Tinggi Kementerian Perindustrian Republik Indonesia (Ditjen IUBTT Kemenperin). Gedung yang berlokasi pada posisi 6°53'20.5\" LS, 107°36'31.6\" BT. Gedung berlantai empat dengan satu lantai mezanin ini memiliki luas lantai dasar 1.300 meter persegi, luas total 6.900 meter persegi.",
    "src": "/maps/5I.jpg"
  },
  {
    "location_code": "5J",
    "location_name": "Labtek III",
    "latitude": -6.888720869914548,
    "longitude": 107.6083346798587,
    "description": "Gedung Laboratorium Teknik III atau disingkat Labtek III yang terdiri dari dua blok berlantai lima yang saling berhubungan ini merupakan gedung yang mengakomodasikan Program Studi Teknik Industri, Program Studi Matematika, Program Studi Astronomi, dan kantor administrasi Fakultas Teknologi Industri sejak awal semester gasal 1985-1986 (sekitar pertengahan tahun 1985).  Tahun 2017 renovasi Labtek III selesai dan kini dinamai dengan nama Matthias Aroef. Peresmian hasil renovasi gedung dilaksanakan hari Sabtu, 25 Maret 2017 di gedung Labtek III. Gedung ini berlokasi pada posisi 6°53'19\" LS, 107°36'31\" BT atau di sebelah barat laut kampus di sebelah selatan Gedung SBM ITB.",
    "src": "/maps/5J.jpg"
  },
  {
    "location_code": "6A",
    "location_name": "Labtek XIX (Lab Freeport)",
    "latitude": -6.888198581620493,
    "longitude": 107.60833348353788,
    "description": "Labtek XIX dibangun dengan mengirimkan Proposal t ke Freeport McMoRan, Inc. di Phoenix, AS. Setelah mendapat lampu hijau dari Freeport McMoRan, Inc., rencana tersebut selanjutnya dijabarkan sebagai dokumen Detail Engineering Design. Selanjutnya, Freeport McMoRan menugaskan anak usahanya—PT Freeport Indonesia—untuk mengawasi realisasi tersebut.",
    "src": "/maps/6A.jpg"
  },
  {
    "location_code": "6D",
    "location_name": "Gedung SBM",
    "latitude": -6.8880673561569425,
    "longitude": 107.60888658290042,
    "description": "Gedung yang terletak di Jl. Tamansari No.84, pojok barat laut Kampus Ganesha ini semula merupakan milik \"Lembaga Penjelidikan Masalah Bangun-Bangunan, Didirikan pada tanggal 22 Desember 1953 dengan gedungnya yang berberwarna warni.",
    "src": "/maps/6D.jpg"
  },
  {
    "location_code": "6E",
    "location_name": "Student Lounge SBM",
    "latitude": -6.887912910849659,
    "longitude": 107.60919771913154,
    "description": "Tempat paling nyaman untuk kegiatan belajar, istirahat, hingga mendiskusikan apapun, merupakan ruangan yang lengkap dengan segala fasilitas dan dihuni oleh penghuni gedung warna-warni.",
    "src": "/maps/6E.jpg"
  },
  {
    "location_code": "6F",
    "location_name": "Gedung CADL",
    "latitude": -6.8885979805498465,
    "longitude": 107.60963640440394,
    "description": "Mulai dibangun pada 4 April 2014, selesai dibangun pada 2015, dan diresmikan pada 29 Agustus 2016. Gedung CADL berlokasi pada posisi 6°53'18\" LS, 107°36'34\" BT. Gedung ini memiliki luas lantai dasar 1.565 meter persegi, luas total 8.196 meter persegi, dengan ketinggian 7 lantai, dengan sumber dana dari APBN dan JICA.",
    "src": "/maps/6F.jpg"
  },
  {
    "location_code": "6H",
    "location_name": "Gedung PAU",
    "latitude": -6.888578407209728,
    "longitude": 107.61007196820063,
    "description": "Gedung Pusat Antar Universitas (PAU) memiliki luas dasar bangunan eksisting sebesar 1476,435 meter persegi, memiliki 8 lantai. Gedung ini pertama kali didirikan sekitar tahun 1980 dan sempat dilakukan rehabilitasi di tahun 2021 sampai 2022.",
    "src": "/maps/6H.jpg"
  },
  {
    "location_code": "6I",
    "location_name": "Sunken Court",
    "latitude": -6.888326970314629,
    "longitude": 107.61027050930264,
    "description": "Mulai dibangun pada 1995 dan selesai pada 1996. Sunken Court adalah ruang terbuka yang terletak di antara Gedung Perpustakaan Pusat dan Gedung Riset dan Inovasi (eks PAU) yang dibenamkan ke dalam tanah namun masih memiliki hubungan/kontak dengan ruang yang berada lebih tinggi darinya. Ruang-ruang di sekitar sunken digunakan untuk sebagian unit kegiatan mahasiswa yang langsung terhubung ke sarana olahraga Lebak Siliwangi melalui terowongan bawah tanah yang memotong Jl. Tamansari. ",
    "src": "/maps/6I.jpg"
  },
  {
    "location_code": "7A",
    "location_name": "Pusat Gema",
    "latitude": -6.889879331580188,
    "longitude": 107.6103276093177,
    "description": null,
    "src": "/maps/7A.png"
  },
  {
    "location_code": "7B",
    "location_name": "DPR",
    "latitude": -6.889811895008769,
    "longitude": 107.6099332602668,
    "description": "“Di bawah Pohon Rindang” atau biasa disebut dengan DPR, adalah tempat yang dipenuhi pohon-pohon besar di sekelilingnya. Selain itu, di sini juga disediakan fasilitas seperti tempat duduk yang dapat digunakan mahasiswa ITB. Suasana rindang dan adem membuat DPR menjadi tempat favorit mahasiswa untuk ngobrol. DPR dibagi menjadi 2 sisi, yaitu barat dan timur.",
    "src": "/maps/7B.png"
  },
  {
    "location_code": "7B",
    "location_name": "DPR",
    "latitude": -6.889811895008769,
    "longitude": 107.6090332602668,
    "description": "“Di bawah Pohon Rindang” atau biasa disebut dengan DPR, adalah tempat yang dipenuhi pohon-pohon besar di sekelilingnya. Selain itu, di sini juga disediakan fasilitas seperti tempat duduk yang dapat digunakan mahasiswa ITB. Suasana rindang dan adem membuat DPR menjadi tempat favorit mahasiswa untuk ngobrol. DPR dibagi menjadi 2 sisi, yaitu barat dan timur.",
    "src": "/maps/7B.png"
  },
  {
    "location_code": "7C",
    "location_name": "TVST",
    "latitude": -6.889503234830757,
    "longitude": 107.61006027986828,
    "description": "Gedung TVST (Televisi Siaran Terbatas) merupakan gedung kuliah umum berlantai dua dengan satu lantai basement yang berbentuk segi delapan yang semula terdiri atas 3 ruang kelas sedang (masing-masing dapat menampung sekitar 108 orang) di lantai dasar dan 3 ruang kelas besar (masing-masing dapat menampung sekitar 228 orang) di lantai dua. Walau bentuk dan ukurannya menyerupai gedung Oktagon yang lebih dahulu dibangun, perbedaan gedung TVST adalah pada fasilitas televisi siaran terbatas yang terdapat pada setiap kelas.",
    "src": "/maps/7C.png"
  },
  {
    "location_code": "7E",
    "location_name": "Gedung PLN-ITB",
    "latitude": -6.889479091856868,
    "longitude": 107.61060082954133,
    "description": "Laboratorium yang semula bernama Laboratorium Kerjasama PLN-ITB ini menampung beberapa laboratorium Sekolah Teknik Elektro dan Informatika (STEI) khususnya Program Studi Teknik Tenaga Listrik antara lain untuk Laboratorium Penelitian Sistem Tenaga dan Distribusi, Laboratorium Teknik Tegangan Tinggi dan Pengukuran Listrik. Gedung berlantai dua ini berlokasi pada posisi 6°53'22\" LS, 107°36'39\" BT.",
    "src": "/maps/7E.png"
  },
  {
    "location_code": "7F",
    "location_name": "Oktagon",
    "latitude": -6.8890592352826125,
    "longitude": 107.61004653875747,
    "description": "Gedung Oktagon merupakan gedung kuliah umum berlantai dua yang berbentuk segi delapan yang semula terdiri atas 3 ruang kelas sedang (masing-masing dapat menampung sekitar 106 orang) di lantai dasar dan 3 ruang kelas besar (masing-masing dapat menampung sekitar 222 orang) di lantai dua. Gedung ini berlokasi pada posisi 6°53'20.5\" LS, 107°36'36\" BT.",
    "src": "/maps/7F.png"
  },
  {
    "location_code": "7G",
    "location_name": "LFD",
    "latitude": -6.889062267376235,
    "longitude": 107.6105803780197,
    "description": "Laboratorium Fisika Dasar (LFD) merupakan bagian penting dari layanan pendidikan ITB, yang menyelenggarakan praktikum Fisika Dasar bagi mahasiswa Tahap Persiapan Bersama (TPB). Dengan praktikan yang berasal dari hampir seluruh Fakultas/Sekolah, LFD adalah lab dengan layanan praktikum terbesar di ITB.",
    "src": "/maps/7G.png"
  },
  {
    "location_code": "7H",
    "location_name": "Selasar ITB 1992",
    "latitude": -6.888215810437311,
    "longitude": 107.61058167063379,
    "description": null,
    "src": "/maps/7H.png"
  },
  {
    "location_code": "7I",
    "location_name": "Perpustakaan Pusat",
    "latitude": -6.888432787974999,
    "longitude": 107.6106874136079,
    "description": "Gedung Perpustakaan Pusat yang berlantai empat dengan satu lantai basement ini berlokasi pada posisi 6°53'18\" LS, 107°36'39\" BT atau di sebelah timur \"Sunken Court\" dan Gedung PAU di bagian utara kampus. Pertengahan tahun 1987 sebuah gedung perpustakaan yang cukup megah berdiri di kampus ITB dengan luas 9.000 meter persegi.",
    "src": "/maps/7I.png"
  },
  {
    "location_code": "7J",
    "location_name": "Ruang Belajar IA-ITB 80",
    "latitude": -6.887657170887209,
    "longitude": 107.61083279763807,
    "description": "Co-working space yang berada di dekat gerbang utara ITB, mulai dibangun pada tahun 2023, merupakan hasil sumbangan alumni ITB 1980.",
    "src": "/maps/7J.png"
  },
  {
    "location_code": "8A",
    "location_name": "Gedung Kimia",
    "latitude": -6.889320006460698,
    "longitude": 107.61172524548233,
    "description": "Gedung Kimia berlantai tiga ini merupakan pengganti Gedung \"prefab\" Kimia I (1950an-1974) yang terbakar dan dibangun di lokasi yang sama yaitu posisi 6°53'21.5\" LS, 107°36'43\" BT atau di sebelah timur Labtek I, di sebelah selatan Gedung BSC-B.",
    "src": "/maps/8A.png"
  },
  {
    "location_code": "8B",
    "location_name": "Labtek I Mektan",
    "latitude": -6.889222661107381,
    "longitude": 107.61116775959976,
    "description": "Gedung Laboratorium Teknik I atau disingkat Labtek I ini semula merupakan gedung yang mengakomodasikan beberapa laboratorium untuk jurusan Teknik Elektro dan Teknik Sipil (Laboratorium Rekayasa Struktur, Laboratorium Rekayasa Jalan dan Lalu Lintas, Laboratorium Mekanika Tanah) sejak tahun 1980an. Laboratorium Rekayasa Struktur (sebelumnya bernama Laboratorium Mekanika) sebelumnya menempati perluasan Gedung Teknik Sipil sisi barat, sedangkan Laboratorium Mekanika Tanah sebelumnya menempati bekas Laboratorium simulasi hidrodinamika. Gedung berlantai tiga ini berlokasi pada posisi 6°53'21\" LS, 107°36'40\" BT).",
    "src": "/maps/8B.png"
  },
  {
    "location_code": "8C",
    "location_name": "BSC-B",
    "latitude": -6.8889907979443565,
    "longitude": 107.6116898185284,
    "description": "Gedung \"Basic Science Center B\" (BSC-B) merupakan gedung yang mengakomodasikan kantor administrasi Fakultas Teknik Pertambangan dan Perminyakan (FTTM) (lantai 4), Prodi Teknik Geofisika (lantai 2), dan Laboratorium Kimia Dasar. Gedung BSC-B yang berlantai lima dengan satu lantai basement ini berlokasi pada posisi 6°53'20\" LS, 107°36'42\" BT atau di sebelah selatan Gedung Teknik Perminyakan. Gedung ini selesai dibangun sekiytar Juni 2005.",
    "src": "/maps/8C.png"
  },
  {
    "location_code": "8D",
    "location_name": "Lab Kidas",
    "latitude": -6.889085378420054,
    "longitude": 107.61212470318851,
    "description": "Laboratorium yang terletak di gedung BSC-B, Laboratorium Kimia Dasar di lantai dasar untuk menggantikan laboratorium di Gedung \"prefab\" Kimia I yang terbakar, 6°53'20.6\"S 107°36'43.5\"E",
    "src": "/maps/8D.png"
  },
  {
    "location_code": "8E",
    "location_name": "Gedung Energi",
    "latitude": -6.888744047057439,
    "longitude": 107.6124550160534,
    "description": "Gedung berlantai delapan yang berlokasi pada posisi 6°53'19\" LS, 107°36'44\" BT atau di sebelah selatan Labtek IV wilayah Fakultas Teknik Pertambangan dan Perminyakan (FTTM) ITB ini mulai dibangun sejak tahun 2013 dan diresmikan penggunaannya oleh Rektor ITB Prof. Akhmaloka pada hari Kamis, 3 April 2014.Gedung ini digunakan untuk semua akademisi dari berbagai universitas atau pusat penelitian lainnya yang ingin mengembangkan sumber daya energi dan mineral.",
    "src": "/maps/8E.png"
  },
  {
    "location_code": "8F",
    "location_name": "Kantin East Corner",
    "latitude": -6.8888831672945495,
    "longitude": 107.61270716819968,
    "description": "Tempat makan anak-anak timur jauh dan, terkenal dengan menunya yang lengkap.",
    "src": "/maps/8F.png"
  },
  {
    "location_code": "8G",
    "location_name": "Taman Batu Geologi",
    "latitude": -6.888247558851808,
    "longitude": 107.6116889387002,
    "description": "Taman Batu ini diresmikan oleh Rektor ITB Bapak. Prof. Dr. Ir. Kadarsah Suryadi, DEA pada hari jum’at tanggal 21 Desember 2018. Taman Batu ini memiliki koleksi 39 jenis batuan. Taman ini diharapkan dapat memperlihatkan keanegaraman batu yang menjadi objek penelitian orang-orang Geologi.",
    "src": "/maps/8G.png"
  },
  {
    "location_code": "8H",
    "location_name": "CAS",
    "latitude": -6.888100401807877,
    "longitude": 107.61129633874969,
    "description": "Mulai dibangun pada 4 April 2014, mulai digunakan pada tahun 2015 (pertengahan semester I 2015-2016), dan diresmikan pada 29 Agustus 2016. Gedung CAS yang berlokasi pada posisi 6°53'18\" LS, 107°36'41\" BT atau di sebelah timur Perpustakaan Pusat ini menempati bekas Pool Kendaraan II yang telah dibongkar sebelumnya. Gedung ini memiliki luas lantai dasar 2.456 meter persegi, luas total 8.337 meter persegi, dengan ketinggian 7 lantai.",
    "src": "/maps/8H.png"
  },
  {
    "location_code": "8I",
    "location_name": "Taman CRCS",
    "latitude": -6.887763008149332,
    "longitude": 107.61128929829023,
    "description": "Taman yang berada di sisi barat dari gedung CRCS dan sisi utara gedung CAS. Taman ini berada di dekat Gerbang Dayang Sumbi.",
    "src": "/maps/8I.png"
  },
  {
    "location_code": "8J",
    "location_name": "CRCS",
    "latitude": -6.8877257994930945,
    "longitude": 107.61155624058117,
    "description": "Mulai dibangun pada 4 April 2014, selesai dibangun 2015, dan diresmikan pada 29 Agustus 2016. Gedung CRCS yang berlokasi pada posisi 6°53'16\" LS, 107°36'42\" BT atau di timur laut kampus ini menempati bekas kantor LAPI ITB dan Puslog ITB yang telah dibongkar sebelumnya. Gedung ini memiliki luas lantai dasar 2.258 meter persegi, luas total 7.268 meter persegi, dengan ketinggian 7 lantai.",
    "src": "/maps/8J.png"
  },
  {
    "location_code": "8K",
    "location_name": "Labtek IV",
    "latitude": -6.8884257994930945,
    "longitude": 107.61203624058117,
    "description": "Labtek IV digunakan oleh beberapa departemen di FIKTM atau yang saat ini terbagi dua menjadi FITB dan FTTM. Bangunan tersebut terdiri dari Pusat Pendidikan di Photogrammetric, Kartografi Jurusan Teknik Geodesi, dan Surya Laboratorium di Departemen Mekanika. Penggunaan warna merah menjadi aksen untuk sun shading bangunan yang berada di bagian paling atas bangunan.",
    "src": "/maps/8K.jpg"
  }
]
